[Killed] ConditionalExpression
src/rentri/services/mud.service.ts:87:13
       let mainDestination: string | null = null;
       let maxCount = 0;
       for (const [dest, count] of data.destinations.entries()) {
-        if (count > maxCount) {
+        if (true) {
           maxCount = count;
           mainDestination = dest;
killedBy: MudService getPreview should identify main destination by highest count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Dest A"
Received: "Dest B"

[Killed] ArrayDeclaration
src/rentri/services/mud.service.ts:123:12
         `"${row.cerCode}","${row.cerDescription}",${row.totalKg.toFixed(3)},${row.operationCount},"${row.mainDestination || ''}"`,
     );
 
-    return [header, ...lines].join('\n');
+    return [].join('\n');
   }
 }
killedBy: MudService exportCsv should generate CSV with header and data rows
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CER,Descrizione,Quantita kg,Nr. Operazioni,Destinazione principale"
Received: ""
