[Killed] ObjectLiteral
src/canned-job/canned-response.service.ts:29:52
     tenantId: string,
     filters: { category?: string },
   ): Promise<Awaited<ReturnType<PrismaService['cannedResponse']['findMany']>>> {
-    const where: Prisma.CannedResponseWhereInput = { tenantId };
+    const where: Prisma.CannedResponseWhereInput = {};
 
     if (filters.category) {
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"where": {"tenantId": "t1"}}
Received: {"orderBy": {"createdAt": "desc"}, "where": {}}

Number of calls: 1
