[Killed] ObjectLiteral
src/rentri/services/mud.service.ts:47:24
     const firs = await this.prisma.wasteFir.count({
       where: {
         tenantId,
-        scheduledDate: { gte: yearStart, lte: yearEnd },
+        scheduledDate: {},
       },
     });
killedBy: MudService getPreview year range should query FIR count with same year range
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "where": Object {
-     "scheduledDate": Object {

[Killed] BlockStatement
src/rentri/services/mud.service.ts:62:34
       }
     >();
 
-    for (const entry of entries) {
-      const existing = cerMap.get(entry.cerCode);
-      if (existing) {
-        existing.totalKg += Number(entry.quantityKg);
-        existing.operationCount += 1;
-        if (entry.destination) {
-          const destCount = existing.destinations.get(entry.destination.name) || 0;
-          existing.destinations.set(entry.destination.name, destCount + 1);
-        }
-      } else {
-        const destinations = new Map<string, number>();
-        if (entry.destination) {
-          destinations.set(entry.destination.name, 1);
-        }
-        cerMap.set(entry.cerCode, {
-          cerDescription: entry.cerDescription,
-          totalKg: Number(entry.quantityKg),
-          operationCount: 1,
-          destinations,
-        });
-      }
-    }
+    for (const entry of entries) {}
 
     const rows: MudCerRow[] = Array.from(cerMap.entries()).map(([cerCode, data]) => {
killedBy: MudService getPreview should return preview with aggregated data
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] BlockStatement
src/rentri/services/mud.service.ts:64:21
 
     for (const entry of entries) {
       const existing = cerMap.get(entry.cerCode);
-      if (existing) {
-        existing.totalKg += Number(entry.quantityKg);
-        existing.operationCount += 1;
-        if (entry.destination) {
-          const destCount = existing.destinations.get(entry.destination.name) || 0;
-          existing.destinations.set(entry.destination.name, destCount + 1);
-        }
-      } else {
+      if (existing) {} else {
         const destinations = new Map<string, number>();
         if (entry.destination) {
killedBy: MudService getPreview should return preview with aggregated data
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 30
Received: 10

[Killed] AssignmentOperator
src/rentri/services/mud.service.ts:65:9
     for (const entry of entries) {
       const existing = cerMap.get(entry.cerCode);
       if (existing) {
-        existing.totalKg += Number(entry.quantityKg);
+        existing.totalKg -= Number(entry.quantityKg);
         existing.operationCount += 1;
         if (entry.destination) {
killedBy: MudService getPreview should return preview with aggregated data
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 30
Received: -10

[Killed] AssignmentOperator
src/rentri/services/mud.service.ts:66:9
       const existing = cerMap.get(entry.cerCode);
       if (existing) {
         existing.totalKg += Number(entry.quantityKg);
-        existing.operationCount += 1;
+        existing.operationCount -= 1;
         if (entry.destination) {
           const destCount = existing.destinations.get(entry.destination.name) || 0;
killedBy: MudService getPreview should return preview with aggregated data
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Survived] BlockStatement
src/rentri/services/mud.service.ts:67:32
       if (existing) {
         existing.totalKg += Number(entry.quantityKg);
         existing.operationCount += 1;
-        if (entry.destination) {
-          const destCount = existing.destinations.get(entry.destination.name) || 0;
-          existing.destinations.set(entry.destination.name, destCount + 1);
-        }
+        if (entry.destination) {}
       } else {
         const destinations = new Map<string, number>();

[Killed] ArithmeticOperator
src/rentri/services/mud.service.ts:69:61
         existing.operationCount += 1;
         if (entry.destination) {
           const destCount = existing.destinations.get(entry.destination.name) || 0;
-          existing.destinations.set(entry.destination.name, destCount + 1);
+          existing.destinations.set(entry.destination.name, destCount - 1);
         }
       } else {
killedBy: MudService getPreview should identify main destination by highest count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Dest A"
Received: null

[Killed] BlockStatement
src/rentri/services/mud.service.ts:71:14
           const destCount = existing.destinations.get(entry.destination.name) || 0;
           existing.destinations.set(entry.destination.name, destCount + 1);
         }
-      } else {
-        const destinations = new Map<string, number>();
-        if (entry.destination) {
-          destinations.set(entry.destination.name, 1);
-        }
-        cerMap.set(entry.cerCode, {
-          cerDescription: entry.cerDescription,
-          totalKg: Number(entry.quantityKg),
-          operationCount: 1,
-          destinations,
-        });
-      }
+      } else {}
     }
 
killedBy: MudService getPreview should return preview with aggregated data
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] BlockStatement
src/rentri/services/mud.service.ts:73:32
         }
       } else {
         const destinations = new Map<string, number>();
-        if (entry.destination) {
-          destinations.set(entry.destination.name, 1);
-        }
+        if (entry.destination) {}
         cerMap.set(entry.cerCode, {
           cerDescription: entry.cerDescription,
killedBy: MudService getPreview should identify main destination by highest count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Dest A"
Received: "Dest B"

[Killed] BlockStatement
src/rentri/services/mud.service.ts:88:64
     const rows: MudCerRow[] = Array.from(cerMap.entries()).map(([cerCode, data]) => {
       let mainDestination: string | null = null;
       let maxCount = 0;
-      for (const [dest, count] of data.destinations.entries()) {
-        if (count > maxCount) {
-          maxCount = count;
-          mainDestination = dest;
-        }
-      }
+      for (const [dest, count] of data.destinations.entries()) {}
 
       return {
killedBy: MudService getPreview should identify main destination by highest count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Dest A"
Received: null

[Killed] BlockStatement
src/rentri/services/mud.service.ts:89:31
       let mainDestination: string | null = null;
       let maxCount = 0;
       for (const [dest, count] of data.destinations.entries()) {
-        if (count > maxCount) {
-          maxCount = count;
-          mainDestination = dest;
-        }
+        if (count > maxCount) {}
       }
 
killedBy: MudService getPreview should identify main destination by highest count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Dest A"
Received: null

[Killed] ConditionalExpression
src/rentri/services/mud.service.ts:89:13
       let mainDestination: string | null = null;
       let maxCount = 0;
       for (const [dest, count] of data.destinations.entries()) {
-        if (count > maxCount) {
+        if (false) {
           maxCount = count;
           mainDestination = dest;
killedBy: MudService getPreview should identify main destination by highest count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Dest A"
Received: null

[Killed] ArithmeticOperator
src/rentri/services/mud.service.ts:108:54
       year,
       rows,
       totalKg: entries.reduce(
-        (sum: number, e: { quantityKg: unknown }) => sum + Number(e.quantityKg),
+        (sum: number, e: { quantityKg: unknown }) => sum - Number(e.quantityKg),
         0,
       ),
killedBy: MudService getPreview should return preview with aggregated data
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 30
Received: -30

[Killed] ArrowFunction
src/rentri/services/mud.service.ts:121:7
 
     const header = 'CER,Descrizione,Quantita kg,Nr. Operazioni,Destinazione principale';
     const lines = preview.rows.map(
-      row =>
-        `"${row.cerCode}","${row.cerDescription}",${row.totalKg.toFixed(3)},${row.operationCount},"${row.mainDestination || ''}"`,
+      () => undefined,
     );
 
killedBy: MudService exportCsv should generate CSV with header and data rows
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "\"130205*\""
Received string:    ""

[Killed] LogicalOperator
src/rentri/services/mud.service.ts:122:102
     const header = 'CER,Descrizione,Quantita kg,Nr. Operazioni,Destinazione principale';
     const lines = preview.rows.map(
       row =>
-        `"${row.cerCode}","${row.cerDescription}",${row.totalKg.toFixed(3)},${row.operationCount},"${row.mainDestination || ''}"`,
+        `"${row.cerCode}","${row.cerDescription}",${row.totalKg.toFixed(3)},${row.operationCount},"${row.mainDestination && ''}"`,
     );
 
killedBy: MudService exportCsv should generate CSV with header and data rows
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "\"Dest A\""
Received string:    "\"130205*\",\"Oli minerali per motori\",25.500,1,\"\""

[Killed] ConditionalExpression
src/rentri/services/mud.service.ts:122:102
     const header = 'CER,Descrizione,Quantita kg,Nr. Operazioni,Destinazione principale';
     const lines = preview.rows.map(
       row =>
-        `"${row.cerCode}","${row.cerDescription}",${row.totalKg.toFixed(3)},${row.operationCount},"${row.mainDestination || ''}"`,
+        `"${row.cerCode}","${row.cerDescription}",${row.totalKg.toFixed(3)},${row.operationCount},"${true}"`,
     );
 
killedBy: MudService exportCsv should generate CSV with header and data rows
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "\"Dest A\""
Received string:    "\"130205*\",\"Oli minerali per motori\",25.500,1,\"true\""
