[Killed] LogicalOperator
src/canned-job/canned-response.service.ts:20:19
         tenantId,
         category: dto.category,
         text: dto.text,
-        severity: dto.severity ?? null,
+        severity: dto.severity && null,
         isActive: dto.isActive ?? true,
       },
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"data": {"category": "DVI", "isActive": true, "severity": "HIGH", "tenantId": "t1", "text": "Usura pastiglie"}}
Received: {"data": {"category": "DVI", "isActive": true, "severity": null, "tenantId": "t1", "text": "Usura pastiglie"}}

Number of calls: 1

[Killed] BooleanLiteral
src/canned-job/canned-response.service.ts:21:35
         category: dto.category,
         text: dto.text,
         severity: dto.severity ?? null,
-        isActive: dto.isActive ?? true,
+        isActive: dto.isActive ?? false,
       },
     });
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"data": ObjectContaining {"isActive": true, "severity": null, "tenantId": "t1"}}
Received: {"data": {"category": "COMUNICAZIONE", "isActive": false, "severity": null, "tenantId": "t1", "text": "Test"}}

Number of calls: 1

[Killed] LogicalOperator
src/canned-job/canned-response.service.ts:21:19
         category: dto.category,
         text: dto.text,
         severity: dto.severity ?? null,
-        isActive: dto.isActive ?? true,
+        isActive: dto.isActive && true,
       },
     });
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"data": ObjectContaining {"isActive": true, "severity": null, "tenantId": "t1"}}
Received: {"data": {"category": "COMUNICAZIONE", "isActive": undefined, "severity": null, "tenantId": "t1", "text": "Test"}}

Number of calls: 1

[Killed] ConditionalExpression
src/canned-job/canned-response.service.ts:32:9
   ): Promise<Awaited<ReturnType<PrismaService['cannedResponse']['findMany']>>> {
     const where: Prisma.CannedResponseWhereInput = { tenantId };
 
-    if (filters.category) {
+    if (false) {
       where.category = filters.category;
     }
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"where": {"category": "DVI", "tenantId": "t1"}}
Received: {"orderBy": {"createdAt": "desc"}, "where": {"tenantId": "t1"}}

Number of calls: 1

[Killed] BlockStatement
src/canned-job/canned-response.service.ts:32:27
   ): Promise<Awaited<ReturnType<PrismaService['cannedResponse']['findMany']>>> {
     const where: Prisma.CannedResponseWhereInput = { tenantId };
 
-    if (filters.category) {
-      where.category = filters.category;
-    }
+    if (filters.category) {}
 
     // Internal: bounded query — canned responses per tenant typically < 50
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"where": {"category": "DVI", "tenantId": "t1"}}
Received: {"orderBy": {"createdAt": "desc"}, "where": {"tenantId": "t1"}}

Number of calls: 1

[Killed] ConditionalExpression
src/canned-job/canned-response.service.ts:51:9
       where: { id, tenantId },
     });
 
-    if (!response) {
+    if (true) {
       throw new NotFoundException(`CannedResponse ${id} not found`);
     }
statusReason: NotFoundException: CannedResponse cr-1 not found

[Killed] ConditionalExpression
src/canned-job/canned-response.service.ts:51:9
       where: { id, tenantId },
     });
 
-    if (!response) {
+    if (false) {
       throw new NotFoundException(`CannedResponse ${id} not found`);
     }
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: null

[Survived] StringLiteral
src/canned-job/canned-response.service.ts:52:35
     });
 
     if (!response) {
-      throw new NotFoundException(`CannedResponse ${id} not found`);
+      throw new NotFoundException(``);
     }
 

[Survived] BooleanLiteral
src/canned-job/canned-response.service.ts:84:25
 
     return this.prisma.cannedResponse.update({
       where: { id },
-      data: { isActive: false },
+      data: { isActive: true },
     });
   }
