[Survived] StringLiteral
src/sms/sms-thread.controller.ts:139:54
     @Headers('x-twilio-signature') twilioSignature: string,
     @Req() req: Request,
   ): Promise<{ success: boolean; queued: boolean }> {
-    const authToken = this.configService.get<string>('TWILIO_AUTH_TOKEN');
+    const authToken = this.configService.get<string>("");
 
     if (!authToken) {

[Survived] BlockStatement
src/sms/sms-thread.controller.ts:141:21
   ): Promise<{ success: boolean; queued: boolean }> {
     const authToken = this.configService.get<string>('TWILIO_AUTH_TOKEN');
 
-    if (!authToken) {
-      if (process.env.NODE_ENV === 'production') {
-        throw new InternalServerErrorException('TWILIO_AUTH_TOKEN not configured');
-      }
-      this.logger.warn(
-        'TWILIO_AUTH_TOKEN not configured — skipping webhook signature verification (dev only)',
-      );
-    } else {
+    if (!authToken) {} else {
       if (!twilioSignature) {
         this.metricsService.authFailuresTotal.inc({ reason: 'webhook_signature' });

[Survived] ConditionalExpression
src/sms/sms-thread.controller.ts:142:11
     const authToken = this.configService.get<string>('TWILIO_AUTH_TOKEN');
 
     if (!authToken) {
-      if (process.env.NODE_ENV === 'production') {
+      if (true) {
         throw new InternalServerErrorException('TWILIO_AUTH_TOKEN not configured');
       }

[Survived] ConditionalExpression
src/sms/sms-thread.controller.ts:142:11
     const authToken = this.configService.get<string>('TWILIO_AUTH_TOKEN');
 
     if (!authToken) {
-      if (process.env.NODE_ENV === 'production') {
+      if (false) {
         throw new InternalServerErrorException('TWILIO_AUTH_TOKEN not configured');
       }

[Survived] BooleanLiteral
src/sms/sms-thread.controller.ts:149:11
         'TWILIO_AUTH_TOKEN not configured — skipping webhook signature verification (dev only)',
       );
     } else {
-      if (!twilioSignature) {
+      if (twilioSignature) {
         this.metricsService.authFailuresTotal.inc({ reason: 'webhook_signature' });
         throw new UnauthorizedException('Missing X-Twilio-Signature header');

[Survived] BlockStatement
src/sms/sms-thread.controller.ts:149:29
         'TWILIO_AUTH_TOKEN not configured — skipping webhook signature verification (dev only)',
       );
     } else {
-      if (!twilioSignature) {
-        this.metricsService.authFailuresTotal.inc({ reason: 'webhook_signature' });
-        throw new UnauthorizedException('Missing X-Twilio-Signature header');
-      }
+      if (!twilioSignature) {}
 
       const url = `${req.protocol}://${req.get('host')}${req.originalUrl}`;

[Survived] StringLiteral
src/sms/sms-thread.controller.ts:150:61
       );
     } else {
       if (!twilioSignature) {
-        this.metricsService.authFailuresTotal.inc({ reason: 'webhook_signature' });
+        this.metricsService.authFailuresTotal.inc({ reason: "" });
         throw new UnauthorizedException('Missing X-Twilio-Signature header');
       }

[Survived] StringLiteral
src/sms/sms-thread.controller.ts:154:19
         throw new UnauthorizedException('Missing X-Twilio-Signature header');
       }
 
-      const url = `${req.protocol}://${req.get('host')}${req.originalUrl}`;
+      const url = ``;
       const params = req.body as Record<string, string>;
       const data =

[Survived] MethodExpression
src/sms/sms-thread.controller.ts:158:9
       const params = req.body as Record<string, string>;
       const data =
         url +
-        Object.keys(params)
-          .sort()
+        Object.keys(params)
           .reduce((acc, key) => acc + key + params[key], '');
       const expectedSignature = crypto

[Survived] ArrowFunction
src/sms/sms-thread.controller.ts:160:19
         url +
         Object.keys(params)
           .sort()
-          .reduce((acc, key) => acc + key + params[key], '');
+          .reduce(() => undefined, '');
       const expectedSignature = crypto
         .createHmac('sha1', authToken)

[Survived] StringLiteral
src/sms/sms-thread.controller.ts:162:21
           .sort()
           .reduce((acc, key) => acc + key + params[key], '');
       const expectedSignature = crypto
-        .createHmac('sha1', authToken)
+        .createHmac("", authToken)
         .update(Buffer.from(data, 'utf-8'))
         .digest('base64');

[Survived] LogicalOperator
src/sms/sms-thread.controller.ts:168:23
 
       const expBuf = Buffer.from(expectedSignature);
       const sigBuf = Buffer.from(twilioSignature);
-      const invalid = expBuf.length !== sigBuf.length || !crypto.timingSafeEqual(expBuf, sigBuf);
+      const invalid = expBuf.length !== sigBuf.length && !crypto.timingSafeEqual(expBuf, sigBuf);
       if (invalid) {
         this.logger.warn('Invalid Twilio webhook signature');

[Survived] BooleanLiteral
src/sms/sms-thread.controller.ts:168:58
 
       const expBuf = Buffer.from(expectedSignature);
       const sigBuf = Buffer.from(twilioSignature);
-      const invalid = expBuf.length !== sigBuf.length || !crypto.timingSafeEqual(expBuf, sigBuf);
+      const invalid = expBuf.length !== sigBuf.length || crypto.timingSafeEqual(expBuf, sigBuf);
       if (invalid) {
         this.logger.warn('Invalid Twilio webhook signature');

[Survived] BlockStatement
src/sms/sms-thread.controller.ts:169:20
       const expBuf = Buffer.from(expectedSignature);
       const sigBuf = Buffer.from(twilioSignature);
       const invalid = expBuf.length !== sigBuf.length || !crypto.timingSafeEqual(expBuf, sigBuf);
-      if (invalid) {
-        this.logger.warn('Invalid Twilio webhook signature');
-        this.metricsService.authFailuresTotal.inc({ reason: 'webhook_signature' });
-        throw new UnauthorizedException('Invalid Twilio signature');
-      }
+      if (invalid) {}
     }
 

[Survived] ConditionalExpression
src/sms/sms-thread.controller.ts:169:11
       const expBuf = Buffer.from(expectedSignature);
       const sigBuf = Buffer.from(twilioSignature);
       const invalid = expBuf.length !== sigBuf.length || !crypto.timingSafeEqual(expBuf, sigBuf);
-      if (invalid) {
+      if (true) {
         this.logger.warn('Invalid Twilio webhook signature');
         this.metricsService.authFailuresTotal.inc({ reason: 'webhook_signature' });

[Survived] StringLiteral
src/sms/sms-thread.controller.ts:170:26
       const sigBuf = Buffer.from(twilioSignature);
       const invalid = expBuf.length !== sigBuf.length || !crypto.timingSafeEqual(expBuf, sigBuf);
       if (invalid) {
-        this.logger.warn('Invalid Twilio webhook signature');
+        this.logger.warn("");
         this.metricsService.authFailuresTotal.inc({ reason: 'webhook_signature' });
         throw new UnauthorizedException('Invalid Twilio signature');

[Survived] ObjectLiteral
src/sms/sms-thread.controller.ts:171:51
       const invalid = expBuf.length !== sigBuf.length || !crypto.timingSafeEqual(expBuf, sigBuf);
       if (invalid) {
         this.logger.warn('Invalid Twilio webhook signature');
-        this.metricsService.authFailuresTotal.inc({ reason: 'webhook_signature' });
+        this.metricsService.authFailuresTotal.inc({});
         throw new UnauthorizedException('Invalid Twilio signature');
       }

[Survived] ObjectLiteral
src/sms/sms-thread.controller.ts:178:48
 
     const phoneHash = crypto.createHash('sha256').update(dto.From).digest('hex');
 
-    await this.smsQueue.add('process-inbound', {
-      tenantId,
-      phoneHash,
-      body: dto.Body,
-      twilioSid: dto.MessageSid,
-    });
+    await this.smsQueue.add('process-inbound', {});
 
     this.metricsService.smsMessagesTotal.labels('INBOUND', 'queued').inc();

[Survived] BooleanLiteral
src/sms/sms-thread.controller.ts:186:23
     });
 
     this.metricsService.smsMessagesTotal.labels('INBOUND', 'queued').inc();
-    return { success: true, queued: true };
+    return { success: false, queued: true };
   }
 }

[Survived] BooleanLiteral
src/sms/sms-thread.controller.ts:186:37
     });
 
     this.metricsService.smsMessagesTotal.labels('INBOUND', 'queued').inc();
-    return { success: true, queued: true };
+    return { success: true, queued: false };
   }
 }
