[Survived] BlockStatement
src/sms/sms-inbound.processor.ts:21:61
     super();
   }
 
-  async process(job: Job<SmsInboundJobData>): Promise<void> {
-    const { tenantId, phoneHash, body, twilioSid } = job.data;
-    this.logger.log(`Processing inbound SMS job ${job.id} for tenant ${tenantId}`);
-
-    await this.smsThreadService.receiveInbound(tenantId, phoneHash, body, twilioSid);
-  }
+  async process(job: Job<SmsInboundJobData>): Promise<void> {}
 }
 

[Survived] StringLiteral
src/sms/sms-inbound.processor.ts:23:21
 
   async process(job: Job<SmsInboundJobData>): Promise<void> {
     const { tenantId, phoneHash, body, twilioSid } = job.data;
-    this.logger.log(`Processing inbound SMS job ${job.id} for tenant ${tenantId}`);
+    this.logger.log(``);
 
     await this.smsThreadService.receiveInbound(tenantId, phoneHash, body, twilioSid);
