[Survived] ObjectLiteral
src/sms/sms-thread.service.ts:30:38
     const where = { tenantId };
 
     const [threads, total] = await Promise.all([
-      this.prisma.smsThread.findMany({
-        where,
-        include: {
-          customer: true,
-          messages: {
-            orderBy: { createdAt: 'desc' as const },
-            take: 1,
-          },
-        },
-        orderBy: { lastMessageAt: 'desc' },
-        take: limit,
-        skip: offset,
-      }),
+      this.prisma.smsThread.findMany({}),
       this.prisma.smsThread.count({ where }),
     ]);

[Survived] ObjectLiteral
src/sms/sms-thread.service.ts:32:18
     const [threads, total] = await Promise.all([
       this.prisma.smsThread.findMany({
         where,
-        include: {
-          customer: true,
-          messages: {
-            orderBy: { createdAt: 'desc' as const },
-            take: 1,
-          },
-        },
+        include: {},
         orderBy: { lastMessageAt: 'desc' },
         take: limit,

[Survived] BooleanLiteral
src/sms/sms-thread.service.ts:33:21
       this.prisma.smsThread.findMany({
         where,
         include: {
-          customer: true,
+          customer: false,
           messages: {
             orderBy: { createdAt: 'desc' as const },

[Survived] ObjectLiteral
src/sms/sms-thread.service.ts:43:35
         take: limit,
         skip: offset,
       }),
-      this.prisma.smsThread.count({ where }),
+      this.prisma.smsThread.count({}),
     ]);
 

[Survived] BooleanLiteral
src/sms/sms-thread.service.ts:62:9
       where: { id: threadId, tenantId },
     });
 
-    if (!thread) {
+    if (thread) {
       throw new NotFoundException(`SMS thread ${threadId} not found`);
     }

[Survived] BlockStatement
src/sms/sms-thread.service.ts:62:18
       where: { id: threadId, tenantId },
     });
 
-    if (!thread) {
-      throw new NotFoundException(`SMS thread ${threadId} not found`);
-    }
+    if (!thread) {}
 
     // Mark as read

[Survived] ObjectLiteral
src/sms/sms-thread.service.ts:75:39
     const where = { threadId };
 
     const [messages, total] = await Promise.all([
-      this.prisma.smsMessage.findMany({
-        where,
-        orderBy: { createdAt: 'desc' },
-        take: limit,
-        skip: offset,
-      }),
+      this.prisma.smsMessage.findMany({}),
       this.prisma.smsMessage.count({ where }),
     ]);

[Survived] ObjectLiteral
src/sms/sms-thread.service.ts:81:36
         take: limit,
         skip: offset,
       }),
-      this.prisma.smsMessage.count({ where }),
+      this.prisma.smsMessage.count({}),
     ]);
 

[Survived] ArrowFunction
src/sms/sms-thread.service.ts:84:44
       this.prisma.smsMessage.count({ where }),
     ]);
 
-    const decryptedMessages = messages.map(m => ({
-      ...m,
-      body: this.encryption.decrypt(m.body),
-    }));
+    const decryptedMessages = messages.map(() => undefined);
     return { messages: decryptedMessages as unknown as SmsMessageResponseDto[], total };
   }

[Survived] ObjectLiteral
src/sms/sms-thread.service.ts:95:58
    * Send an outbound SMS message in an existing thread via Twilio.
    */
   async sendMessage(tenantId: string, threadId: string, body: string): Promise<unknown> {
-    const thread = await this.prisma.smsThread.findFirst({
-      where: { id: threadId, tenantId },
-      include: { customer: true },
-    });
+    const thread = await this.prisma.smsThread.findFirst({});
 
     if (!thread) {

[Survived] BooleanLiteral
src/sms/sms-thread.service.ts:97:28
   async sendMessage(tenantId: string, threadId: string, body: string): Promise<unknown> {
     const thread = await this.prisma.smsThread.findFirst({
       where: { id: threadId, tenantId },
-      include: { customer: true },
+      include: { customer: false },
     });
 

[Survived] ObjectLiteral
src/sms/sms-thread.service.ts:97:16
   async sendMessage(tenantId: string, threadId: string, body: string): Promise<unknown> {
     const thread = await this.prisma.smsThread.findFirst({
       where: { id: threadId, tenantId },
-      include: { customer: true },
+      include: {},
     });
 

[Survived] ConditionalExpression
src/sms/sms-thread.service.ts:100:9
       include: { customer: true },
     });
 
-    if (!thread) {
+    if (false) {
       throw new NotFoundException(`SMS thread ${threadId} not found`);
     }

[Survived] ConditionalExpression
src/sms/sms-thread.service.ts:109:9
     const fromPhone = this.configService.get<string>('TWILIO_PHONE_NUMBER');
 
     let twilioSid: string | null = null;
-    if (accountSid && authToken && fromPhone) {
+    if (false) {
       const toPhone = this.encryption.decrypt((thread as any).customer.encryptedPhone);
       const client = Twilio(accountSid, authToken);

[Survived] ConditionalExpression
src/sms/sms-thread.service.ts:109:9
     const fromPhone = this.configService.get<string>('TWILIO_PHONE_NUMBER');
 
     let twilioSid: string | null = null;
-    if (accountSid && authToken && fromPhone) {
+    if (true) {
       const toPhone = this.encryption.decrypt((thread as any).customer.encryptedPhone);
       const client = Twilio(accountSid, authToken);

[Survived] BlockStatement
src/sms/sms-thread.service.ts:114:55
       const client = Twilio(accountSid, authToken);
       const msg = await client.messages.create({ to: toPhone, from: fromPhone, body });
       twilioSid = msg.sid;
-    } else if (process.env.NODE_ENV === 'production') {
-      throw new InternalServerErrorException('Twilio not configured');
-    } else {
+    } else if (process.env.NODE_ENV === 'production') {} else {
       this.logger.warn('Twilio not configured — skipping outbound SMS (dev only)');
     }

[Survived] ConditionalExpression
src/sms/sms-thread.service.ts:114:16
       const client = Twilio(accountSid, authToken);
       const msg = await client.messages.create({ to: toPhone, from: fromPhone, body });
       twilioSid = msg.sid;
-    } else if (process.env.NODE_ENV === 'production') {
+    } else if (true) {
       throw new InternalServerErrorException('Twilio not configured');
     } else {

[Survived] BlockStatement
src/sms/sms-thread.service.ts:116:12
       twilioSid = msg.sid;
     } else if (process.env.NODE_ENV === 'production') {
       throw new InternalServerErrorException('Twilio not configured');
-    } else {
-      this.logger.warn('Twilio not configured — skipping outbound SMS (dev only)');
-    }
+    } else {}
 
     const message = await this.prisma.smsMessage.create({

[Survived] StringLiteral
src/sms/sms-thread.service.ts:135:21
       data: { lastMessageAt: new Date() },
     });
 
-    this.logger.log(`Outbound SMS sent in thread ${threadId}`);
+    this.logger.log(``);
     return message;
   }

[Survived] ConditionalExpression
src/sms/sms-thread.service.ts:150:9
     twilioSid?: string,
   ): Promise<unknown> {
     // Fix 1: Idempotency — Twilio retries failed webhooks up to 11 times
-    if (twilioSid) {
+    if (true) {
       const existing = await this.prisma.smsMessage.findFirst({ where: { twilioSid } });
       if (existing) {

[Survived] BlockStatement
src/sms/sms-thread.service.ts:150:20
     twilioSid?: string,
   ): Promise<unknown> {
     // Fix 1: Idempotency — Twilio retries failed webhooks up to 11 times
-    if (twilioSid) {
-      const existing = await this.prisma.smsMessage.findFirst({ where: { twilioSid } });
-      if (existing) {
-        this.logger.log(`Duplicate inbound SMS ignored: twilioSid=${twilioSid}`);
-        return { ...existing, body: this.encryption.decrypt(existing.body) };
-      }
-    }
+    if (twilioSid) {}
 
     // Fix 3: Include tenantId in thread lookup to prevent cross-tenant leak

[Survived] ObjectLiteral
src/sms/sms-thread.service.ts:151:63
   ): Promise<unknown> {
     // Fix 1: Idempotency — Twilio retries failed webhooks up to 11 times
     if (twilioSid) {
-      const existing = await this.prisma.smsMessage.findFirst({ where: { twilioSid } });
+      const existing = await this.prisma.smsMessage.findFirst({});
       if (existing) {
         this.logger.log(`Duplicate inbound SMS ignored: twilioSid=${twilioSid}`);

[Survived] BlockStatement
src/sms/sms-thread.service.ts:152:21
     // Fix 1: Idempotency — Twilio retries failed webhooks up to 11 times
     if (twilioSid) {
       const existing = await this.prisma.smsMessage.findFirst({ where: { twilioSid } });
-      if (existing) {
-        this.logger.log(`Duplicate inbound SMS ignored: twilioSid=${twilioSid}`);
-        return { ...existing, body: this.encryption.decrypt(existing.body) };
-      }
+      if (existing) {}
     }
 

[Survived] StringLiteral
src/sms/sms-thread.service.ts:153:25
     if (twilioSid) {
       const existing = await this.prisma.smsMessage.findFirst({ where: { twilioSid } });
       if (existing) {
-        this.logger.log(`Duplicate inbound SMS ignored: twilioSid=${twilioSid}`);
+        this.logger.log(``);
         return { ...existing, body: this.encryption.decrypt(existing.body) };
       }

[Survived] ObjectLiteral
src/sms/sms-thread.service.ts:160:14
 
     // Fix 3: Include tenantId in thread lookup to prevent cross-tenant leak
     const thread = await this.prisma.smsThread.findFirst({
-      where: { phoneHash, tenantId },
+      where: {},
     });
 

[Survived] StringLiteral
src/sms/sms-thread.service.ts:165:35
 
     if (!thread) {
       this.logger.warn(`No thread found for phoneHash in tenant`);
-      throw new NotFoundException(`No SMS thread found for the given phone`);
+      throw new NotFoundException(``);
     }
 

[Survived] LogicalOperator
src/sms/sms-thread.service.ts:174:20
         direction: SmsDirection.INBOUND,
         body: this.encryption.encrypt(body),
         status: SmsStatus.DELIVERED,
-        twilioSid: twilioSid ?? null,
+        twilioSid: twilioSid && null,
       },
     });

[Survived] ObjectLiteral
src/sms/sms-thread.service.ts:180:13
 
     await this.prisma.smsThread.update({
       where: { id: thread.id },
-      data: {
-        unreadCount: { increment: 1 },
-        lastMessageAt: new Date(),
-      },
+      data: {},
     });
 

[Survived] ObjectLiteral
src/sms/sms-thread.service.ts:181:22
     await this.prisma.smsThread.update({
       where: { id: thread.id },
       data: {
-        unreadCount: { increment: 1 },
+        unreadCount: {},
         lastMessageAt: new Date(),
       },
